data ch1101;
input area$ income expend@@;
cards;
北京    11577.48 8922.72        湖北    5855.98  4804.79
天津    8958.7   6987.22        湖南    6780.56  5546.22
河北    5984.82  4479.75        广东    10415.19 8099.63
山西    5391.05  4123.01        广西    6665.73  5224.73
内蒙古  5535.89  4195.62        海南    5838.84  4367.85
辽宁    5797.01  4654.42        重庆    6721.09  5873.69
吉林    5340.46  4337.22        四川    6360.47  5176.17
黑龙江  5425.87  4192.36        贵州    5451.91  4273.9
上海    12883.46 9336.1         云南    6797.71  5252.6
江苏    7375.1   5532.74        西藏    7869.16  5994.39
浙江    10464.67 7952.39        陕西    5483.73  4637.74
安徽    5668.8   4517.65        甘肃    5382.91  4420.31
福建    8313.08  6015.11        青海    5853.72  4698.59
江西    5506.02  3894.51        宁夏    5544.17  4595.4
山东    7101.08  5252.41        新疆    6395.04  4931.4
河南    5267.42  4110.17
;
run;
proc reg graphics;
model expend=income/r clm cli;
output out=result r=residual p=prexpend;
plot student.*p.;
run;
proc print noobs data=result;
run;
